insert into users(is_moderator, reg_time, name, email, password, code, photo)
values (1, '2019-01-01T00:00:00', 'Марк Модераторов', 'mark@gmail.com', 'M0101M', '09175', null),
       (0, '2019-11-25T23:26:00', 'Иван Щербак', 'sherbk@gmail.com', 'gogyTeamfrvr', null, null),
       (0, '2019-01-01T00:00:00', 'Александр Воробьёв', 'avorobev@yandex.ru', 'mydevpub0101', '28871', null),
       (0, '2020-02-29T15:36:47', 'Дмитрий Куплинов', 'kuplinov@gmail.com', 'ku69757g3pl', '37218', null),
       (0, '2019-03-16T20:28:10', 'Антон Зайцев', 'zaicev@yandex.ru', '1234567890', null, null);

insert into posts(is_active, moderation_status, moderator_id, user_id, time, title, text, view_count)
    values (1, 'ACCEPTED', 1, 5, '2019-09-12T12:30:00', 'Сентябрьский пост', 'Текст сентябрьского поста.', 10),
           (1, 'ACCEPTED', 1, 3, '2019-01-01T01:00:00', 'Первый', 'ЕЕЕЕ! Первый пост.', 112),
           (0, 'NEW', null, 5, '2020-12-15T17:39:19', 'Итоги 2020 года', 'На крепкую 4/10.', 0),
           (1, 'ACCEPTED', 1, 1, '2020-01-06T15:19:38', 'Как начать новый год', 'А кто бы знал?', 56),
           (1, 'ACCEPTED', 1, 2, '2020-01-10T21:18:00', 'Как начать карьеру в IT', 'Берёшь и начинаешь)', 73),
           (1, 'ACCEPTED', 1, 4, '2020-05-17T12:32:09', 'Сравнение Java и С', 'С это С, а Java это Java.', 88),
           (0, 'DECLINED', 1, 5, '2019-12-01T18:46:03', 'Самый важный пост', 'Модер не бань(', 0),
           (1, 'ACCEPTED', 1, 2, '2020-06-27T22:18:27', 'Резюме, которое продаёт', 'Резюме.txt: Купите человека.', 110),
           (1, 'ACCEPTED', 1, 3, '2019-05-19T15:46:47', 'Он вам не Java', 'Коротко о С.', 49),
           (1, 'ACCEPTED', 1, 5, '2020-11-12T06:07:08', 'Интересностей пост', 'Как написать приложение?', 39),
           (1, 'ACCEPTED', 1, 1, '2019-01-01T12:34:56', 'Пособие к написанию постов.', 'Как не попасть под банхаммер.', 86);

insert into post_votes(user_id, post_id, time, value)
    values (1, 11, '2020-12-17T20:28:10', 1),
           (1, 1, '2019-10-17T18:39:10', 1),
           (1, 5, '2020-10-01T19:49:00', 1),
           (1, 8, '2020-07-19T10:11:10', 1),
           (2, 2, '2019-01-02T04:17:05', -1),
           (2, 4, '2020-06-01T11:00:38', 1),
           (2, 6, '2020-05-28T16:55:09', 1),
           (2, 10, '2020-11-15T08:11:58',-1),
           (3, 9, '2019-06-18T11:37:06', -1),
           (3, 1, '2020-08-19T00:29:10', 1),
           (3, 8, '2020-07-23T17:27:05', -1),
           (3, 11, '2019-12-18T10:49:01', 1),
           (4, 8, '2020-09-01T23:59:02', 1),
           (4, 4, '2019-02-20T19:26:00', -1),
           (4, 5, '2020-03-01T05:18:06', 1),
           (4, 6, '2020-05-22T08:48:18', 1),
           (5, 8, '2020-10-29T09:19:48', 1),
           (5, 11, '2019-03-17T22:12:03', 1),
           (5, 2, '2019-10-20T14:09:28', -1),
           (5, 1, '2019-09-22T23:00:23', -1);

insert into tags(name)
    values ('Cpp,C'),
           ('Полезное'),
           ('IT'),
           ('Гайд'),
           ('2020'),
           ('Java');

insert into tag2post(post_id, tag_id)
    values (3, 5),
           (3, 3),
           (4, 5),
           (5, 3),
           (5, 2),
           (6, 1),
           (6, 6),
           (6, 2),
           (7, 4),
           (7, 3),
           (8, 2),
           (8, 3),
           (9, 1),
           (9, 2),
           (10, 2),
           (10, 3),
           (10, 4),
           (11, 2),
           (11, 3);

insert into post_comments(parent_id, post_id, user_id, time, text)
    values (null, 1, 3, '2019-09-13T14:23:02', 'А что в итоге-то?'),
           (null, 1, 4, '2019-10-13T18:53:17', 'Скучноо!'),
           (null, 6, 1, '2020-09-13T14:23:02', 'Хорошее сравнение, но можно было уделить больше внимания деталям.'),
           (3, 6, 4, '2020-09-14T18:04:37', 'А чему конкретно?'),
           (4, 6, 1, '2019-09-15T13:48:34', 'Работе с памятью. В целом несколько глубже изучить тему.'),
           (null, 6, 2, '2020-05-28T22:19:48', 'И зачем мне это?');

insert into global_settings(code, name, value)
    values ('MULTIUSER_MODE', 'Многопользовательский режим', 'YES'),
           ('POST_PREMODERATION', 'Премодерация постов', 'NO'),
           ('STATISTIC_IS_PUBLIC', 'Показывать всем статистику блога', 'NO');